<template>
  <div
    class="step-wrapper"
    :class="{ 'no-interactive': !isInteractive, 'step-load': stepLoad }"
  >
    <div class="step-wrapper__block">
      <div class="step-wrapper__content">
        <div class="bg-segment">
          <img src="@/assets/img/modules/module-10/bg-segment.svg" alt="" />
        </div>
        <div
          class="interactive-item"
          :class="[moduleStep == 1 ? 'pulse' : '']"
          data-item="1"
          @click="openStep(1)"
        >
          <img src="@/assets/img/modules/module-10/object-1.svg" alt="" />
        </div>
        <div
          class="interactive-item"
          :class="[moduleStep == 2 ? 'pulse' : '']"
          data-item="2"
          @click="openStep(2)"
        >
          <img src="@/assets/img/modules/module-10/object-2.svg" alt="" />
        </div>

        <div
          class="interactive-item"
          :class="[moduleStep == 3 ? 'pulse' : '']"
          data-item="3"
          @click="openStep(3)"
        >
          <img src="@/assets/img/modules/module-10/object-3.svg" alt="" />
        </div>

        <div
          class="interactive-item"
          :class="[moduleStep == 4 ? 'pulse' : '']"
          data-item="4"
          @click="openStep(4)"
        >
          <img src="@/assets/img/modules/module-10/object-4.svg" alt="" />
        </div>

        <div
          class="arrow-template"
          v-for="step in [1, 2, 3, 4]"
          :class="[moduleStep == step ? 'show' : '']"
          :data-item="step"
        >
          <div class="arrow-template_img"></div>
        </div>

        <transition name="fade" mode="in-out">
          <div
            class="modal-template slider-modal trash-modal"
            v-show="showTrashModal"
          >
            <div class="modal-content">
              <div class="tabs-modal__inner">
                <div class="tabs-content">
                  <h1>
                    На столе немного не прибрано. Давай уберем всё лишнее?
                  </h1>
                  <h3>
                    Чистый рабочий стол — залог продуктивной работы. И чтобы он
                    оставался таким как можно дольше, важно соблюдать следующие
                    правила
                  </h3>
                  <ul>
                    <li>
                      Убери со стола все предметы, которыми ты не пользуешся на
                      постоянной основе. Все лишнее должно быть убрано в ящики
                      или шкаф
                    </li>
                    <li>
                      Организуй оставшиеся предметы таким образом, чтобы они
                      были легко доступны и удобны для использования
                    </li>
                    <li>
                      Создай свою систему хранения и упорядочивания предметов на
                      рабочем столе
                    </li>
                    <li>
                      Организуй хранение бумаг и документов: разложи их по
                      папкам и промаркируй
                    </li>
                    <li>Установи под стол корзину для мусора</li>
                    <li>
                      Содержи рабочее место в чистоте и порядке. Если ты
                      работаешь в РАОСе, то в конце каждого рабочего дня все
                      вещи со стола нужно убирать в ящики или шкафы. А если в
                      Лефорте — в локеры
                    </li>
                  </ul>
                </div>
                <div class="modal-btn" @click="compliteStep(1)">
                  Просмотрено
                </div>
              </div>
            </div>
          </div>
        </transition>

        <transition name="fade" mode="in-out">
          <div
            class="modal-template slider-modal desctop-modal trash-modal"
            v-show="showDesctopModal"
          >
            <div class="modal-content">
              <div class="tabs-modal__inner">
                <div class="tabs-content">
                  <h1>Что ты знаешь об информационной безопасности?</h1>
                  <swiper
                    class="slider-el"
                    :slides-per-view="1"
                    :space-between="50"
                    effect="fade"
                    :autoHeight="true"
                    :fadeEffect="{
                      crossFade: true,
                    }"
                    :navigation="{
                      prevEl: '.slider-prev-btn',
                      nextEl: '.slider-next-btn',
                    }"
                    :modules="[Navigation, Pagination, EffectFade]"
                    :pagination="{ clickable: false }"
                    @reachEnd="() => (sliderModalWiewed = true)"
                  >
                    <swiper-slide class="slide-item">
                      <div class="times-slide__body">
                        <!-- <div class="desctop-modal__head">
                          <div class="desctop-modal__head-ico">
                            <svg
                              width="55"
                              height="48"
                              viewBox="0 0 55 48"
                              fill="none"
                              xmlns="http://www.w3.org/2000/svg"
                            >
                              <rect
                                x="1.5"
                                y="1.5"
                                width="52"
                                height="45"
                                rx="6.5"
                                fill="#0ABBEF"
                              />
                              <rect
                                x="1.5"
                                y="1.5"
                                width="52"
                                height="45"
                                rx="6.5"
                                stroke="black"
                                stroke-width="3"
                              />
                              <path
                                d="M27.5 10C31.0088 13.2147 35.5883 14.8884 40.2682 14.6667C40.9496 17.0669 41.1581 19.5845 40.8813 22.0698C40.6045 24.5552 39.8481 26.9575 38.6571 29.1342C37.466 31.3108 35.8645 33.2173 33.9479 34.7403C32.0313 36.2633 29.8385 37.3719 27.5 38C25.1615 37.3719 22.9687 36.2633 21.0521 34.7403C19.1355 33.2173 17.534 31.3108 16.343 29.1342C15.1519 26.9575 14.3955 24.5552 14.1187 22.0698C13.8419 19.5845 14.0504 17.0669 14.7318 14.6667C19.4117 14.8884 23.9912 13.2147 27.5 10Z"
                                fill="white"
                              />
                              <path
                                d="M25.9981 22.4444C25.9981 22.857 26.1564 23.2527 26.4381 23.5444C26.7198 23.8361 27.1019 24 27.5002 24C27.8986 24 28.2807 23.8361 28.5624 23.5444C28.8441 23.2527 29.0024 22.857 29.0024 22.4444C29.0024 22.0319 28.8441 21.6362 28.5624 21.3445C28.2807 21.0528 27.8986 20.8889 27.5002 20.8889C27.1019 20.8889 26.7198 21.0528 26.4381 21.3445C26.1564 21.6362 25.9981 22.0319 25.9981 22.4444Z"
                                fill="white"
                              />
                              <path d="M27.5002 24V27.8889V24Z" fill="white" />
                              <path
                                d="M27.5002 24C27.1019 24 26.7198 23.8361 26.4381 23.5444C26.1564 23.2527 25.9981 22.857 25.9981 22.4444C25.9981 22.0319 26.1564 21.6362 26.4381 21.3445C26.7198 21.0528 27.1019 20.8889 27.5002 20.8889C27.8986 20.8889 28.2807 21.0528 28.5624 21.3445C28.8441 21.6362 29.0024 22.0319 29.0024 22.4444C29.0024 22.857 28.8441 23.2527 28.5624 23.5444C28.2807 23.8361 27.8986 24 27.5002 24ZM27.5002 24V27.8889M27.5 10C31.0088 13.2147 35.5883 14.8884 40.2682 14.6667C40.9496 17.0669 41.1581 19.5845 40.8813 22.0698C40.6045 24.5552 39.8481 26.9575 38.6571 29.1342C37.466 31.3108 35.8645 33.2173 33.9479 34.7403C32.0313 36.2633 29.8385 37.3719 27.5 38C25.1615 37.3719 22.9687 36.2633 21.0521 34.7403C19.1355 33.2173 17.534 31.3108 16.343 29.1342C15.1519 26.9575 14.3955 24.5552 14.1187 22.0698C13.8419 19.5845 14.0504 17.0669 14.7318 14.6667C19.4117 14.8884 23.9912 13.2147 27.5 10Z"
                                stroke="black"
                                stroke-width="3"
                                stroke-linecap="round"
                                stroke-linejoin="round"
                              />
                            </svg>
                          </div>
                          <div class="desctop-modal__head-title">
                            Что ты знаешь об информационной безопасности?
                          </div>
                        </div> -->
                        <div class="desctop-modal__content">
                          Информационная безопасность — это комплекс мер по
                          защите от утечки или взлома программ, компьютерных
                          систем и данных. Она нужна для защиты
                          конфиденциальности, целостности и доступности данных.
                          Это не просто техническая необходимость, а критический
                          элемент, от которого зависит финансовая стабильность,
                          конкурентоспособность и репутация нашей компании.
                          <br /><br />
                          Все сотрудники обязаны знать основы информационной
                          безопасности. Для этого необходимо пройти специальное
                          обучение
                          <a href="https://elearning.sosafe.de/"
                            >на платформе SoSafe.</a
                          >
                          <br /><br />
                          Интерактивные персонажи научат, как правильно вести
                          себя в интернете и выявлять угрозы.
                          <br /><br />
                          Новые курсы и уроки ты получишь через почтовую
                          рассылку. Обрати внимание, что письма, связанные с
                          обучением, приходят только с этого электронного
                          адреса:
                          <a href="mailto:noreply@sosafe.de"
                            >noreply@sosafe.de</a
                          >
                        </div>
                      </div>
                    </swiper-slide>
                    <swiper-slide class="slide-item">
                      <div class="times-slide__body">
                        <div class="desctop-modal__head">
                          <div class="desctop-modal__head-ico">
                            <svg
                              width="55"
                              height="48"
                              viewBox="0 0 55 48"
                              fill="none"
                              xmlns="http://www.w3.org/2000/svg"
                            >
                              <rect
                                x="1.5"
                                y="1.5"
                                width="52"
                                height="45"
                                rx="6.5"
                                fill="#0ABBEF"
                              />
                              <rect
                                x="1.5"
                                y="1.5"
                                width="52"
                                height="45"
                                rx="6.5"
                                stroke="black"
                                stroke-width="3"
                              />
                              <path
                                d="M27.5 10C31.0088 13.2147 35.5883 14.8884 40.2682 14.6667C40.9496 17.0669 41.1581 19.5845 40.8813 22.0698C40.6045 24.5552 39.8481 26.9575 38.6571 29.1342C37.466 31.3108 35.8645 33.2173 33.9479 34.7403C32.0313 36.2633 29.8385 37.3719 27.5 38C25.1615 37.3719 22.9687 36.2633 21.0521 34.7403C19.1355 33.2173 17.534 31.3108 16.343 29.1342C15.1519 26.9575 14.3955 24.5552 14.1187 22.0698C13.8419 19.5845 14.0504 17.0669 14.7318 14.6667C19.4117 14.8884 23.9912 13.2147 27.5 10Z"
                                fill="white"
                              />
                              <path
                                d="M25.9981 22.4444C25.9981 22.857 26.1564 23.2527 26.4381 23.5444C26.7198 23.8361 27.1019 24 27.5002 24C27.8986 24 28.2807 23.8361 28.5624 23.5444C28.8441 23.2527 29.0024 22.857 29.0024 22.4444C29.0024 22.0319 28.8441 21.6362 28.5624 21.3445C28.2807 21.0528 27.8986 20.8889 27.5002 20.8889C27.1019 20.8889 26.7198 21.0528 26.4381 21.3445C26.1564 21.6362 25.9981 22.0319 25.9981 22.4444Z"
                                fill="white"
                              />
                              <path d="M27.5002 24V27.8889V24Z" fill="white" />
                              <path
                                d="M27.5002 24C27.1019 24 26.7198 23.8361 26.4381 23.5444C26.1564 23.2527 25.9981 22.857 25.9981 22.4444C25.9981 22.0319 26.1564 21.6362 26.4381 21.3445C26.7198 21.0528 27.1019 20.8889 27.5002 20.8889C27.8986 20.8889 28.2807 21.0528 28.5624 21.3445C28.8441 21.6362 29.0024 22.0319 29.0024 22.4444C29.0024 22.857 28.8441 23.2527 28.5624 23.5444C28.2807 23.8361 27.8986 24 27.5002 24ZM27.5002 24V27.8889M27.5 10C31.0088 13.2147 35.5883 14.8884 40.2682 14.6667C40.9496 17.0669 41.1581 19.5845 40.8813 22.0698C40.6045 24.5552 39.8481 26.9575 38.6571 29.1342C37.466 31.3108 35.8645 33.2173 33.9479 34.7403C32.0313 36.2633 29.8385 37.3719 27.5 38C25.1615 37.3719 22.9687 36.2633 21.0521 34.7403C19.1355 33.2173 17.534 31.3108 16.343 29.1342C15.1519 26.9575 14.3955 24.5552 14.1187 22.0698C13.8419 19.5845 14.0504 17.0669 14.7318 14.6667C19.4117 14.8884 23.9912 13.2147 27.5 10Z"
                                stroke="black"
                                stroke-width="3"
                                stroke-linecap="round"
                                stroke-linejoin="round"
                              />
                            </svg>
                          </div>
                          <div class="desctop-modal__head-title">
                            А еще на SoSafe есть и другие возможности:
                          </div>
                        </div>
                        <div class="desctop-modal__content">
                          <ul>
                            <li>
                              <h3>Индивидуальное обучение</h3>
                              <p>
                                Каждый год 1 сентября на платформе появляются
                                новые обучающие курсы, адаптированные к твоим
                                личным потребностям. Поэтому обращай внимание на
                                опросы, которые вам будут предлагать: от ответов
                                зависит то, каким будет твоё дальнейшее обучение
                              </p>
                            </li>

                            <li>
                              <h3>Контроль успеваемости</h3>
                              <p>
                                Если у тебя руководящая должность, то ты
                                автоматически будешь получать уведомления о
                                прохождении или просрочке всех обязательных
                                тренингов своих сотрудников
                              </p>
                            </li>

                            <li>
                              <h3>Бери максимум</h3>
                              <p>
                                Не все тренинги будут обязательными. Но
                                желательно, конечно, проходить максимум, чтобы
                                защитить себя от кибератак или попыток
                                мошенничества не только в повседневной работе,
                                но и в личной жизни
                              </p>
                            </li>
                          </ul>
                        </div>
                      </div>
                    </swiper-slide>
                    <div class="nav-buttons">
                      <div class="slider-prev-btn">Назад</div>
                      <div class="slider-next-btn">Дальше</div>
                    </div>
                  </swiper>
                  <div class="line"></div>
                </div>
                <button
                  class="modal-btn"
                  :disabled="!sliderModalWiewed"
                  @click="compliteStep(2)"
                >
                  Просмотрено
                </button>
              </div>
            </div>
          </div>
        </transition>
        <transition name="fade" mode="in-out">
          <div
            class="modal-template slider-modal sanitazer-modal trash-modal"
            v-show="showSanitazerModal"
          >
            <div class="modal-content">
              <div class="tabs-modal__inner">
                <div class="tabs-content">
                  <swiper
                    :controller="{ control: controlledSwiper }"
                    @swiper="setControlledSwiper"
                    class="slider-el"
                    :slides-per-view="1"
                    :space-between="50"
                    effect="fade"
                    :autoHeight="true"
                    :fadeEffect="{
                      crossFade: true,
                    }"
                    :navigation="{
                      prevEl: '.slider-prev-btn',
                      nextEl: '.slider-next-btn',
                    }"
                    :modules="[Navigation, Pagination, EffectFade, Controller]"
                    :pagination="{ clickable: false }"
                    @reachEnd="() => (sanitazerModalWiewed = true)"
                  >
                    <swiper-slide class="slide-item">
                      <div class="times-slide__body">
                        <div class="desctop-modal__head">
                          <div class="desctop-modal__head-ico">
                            <svg
                              width="55"
                              height="48"
                              viewBox="0 0 55 48"
                              fill="none"
                              xmlns="http://www.w3.org/2000/svg"
                            >
                              <rect
                                x="1.5"
                                y="1.5"
                                width="52"
                                height="45"
                                rx="6.5"
                                fill="#EA5E6B"
                              />
                              <rect
                                x="1.5"
                                y="1.5"
                                width="52"
                                height="45"
                                rx="6.5"
                                stroke="black"
                                stroke-width="3"
                              />
                              <path
                                d="M18.8633 14.0113C20.8841 16.8009 21.9938 20.3617 21.9898 24.0437C21.9898 27.8872 20.8058 31.403 18.8467 34.1003"
                                fill="white"
                              />
                              <path
                                d="M46 18.4984C31.7273 37.5225 18.7125 41.0823 9 23.9942C18.7125 6.91937 31.7273 10.4813 46 29.5032"
                                fill="white"
                              />
                              <path
                                d="M16.4399 21.8427V21.8647V21.8427Z"
                                fill="white"
                              />
                              <path
                                d="M28.4648 20.7426C29.6988 22.9427 29.6988 25.1428 28.4648 27.3429V20.7426Z"
                                fill="white"
                              />
                              <path
                                d="M18.8633 14.0113C20.8841 16.8009 21.9938 20.3617 21.9898 24.0437C21.9898 27.8872 20.8058 31.403 18.8467 34.1003M46 18.4984C31.7273 37.5225 18.7125 41.0823 9 23.9942C18.7125 6.91937 31.7273 10.4813 46 29.5032M16.4399 21.8427V21.8647M28.4648 20.7426C29.6988 22.9427 29.6988 25.1428 28.4648 27.3429"
                                stroke="black"
                                stroke-width="3"
                                stroke-linecap="round"
                                stroke-linejoin="round"
                              />
                            </svg>
                          </div>
                          <div class="desctop-modal__head-title">
                            Как не стать жертвой фишинга?
                          </div>
                        </div>
                        <div class="desctop-modal__content">
                          Фишинг (phishing, производное от английского fishing —
                          рыбная ловля и password — пароль) — вид
                          интернет-мошенничества, при котором злоумышленники
                          присылают пользователям ссылки в письмах по
                          электронной почте, в мессенджерах или на других
                          сайтах. Эти ссылки ведут на вредоносные веб-страницы,
                          которые имитируют сайты известных организаций. Цель
                          фишинга — заставить пользователя перейти по ссылке, а
                          затем ввести на сайте свои данные или загрузить на
                          устройство вредоносное программное обеспечение,
                          которое способно украсть пароли, перехватывать
                          управление гаджетом и компьютером, зашифровать данные.
                          При атаке на сотрудника компании главная цель —
                          проникнуть в корпоративную систему
                        </div>
                      </div>
                    </swiper-slide>
                    <swiper-slide class="slide-item">
                      <div class="times-slide__body">
                        <div class="desctop-modal__head">
                          <div class="desctop-modal__head-ico">
                            <svg
                              width="55"
                              height="48"
                              viewBox="0 0 55 48"
                              fill="none"
                              xmlns="http://www.w3.org/2000/svg"
                            >
                              <rect
                                x="1.5"
                                y="1.5"
                                width="52"
                                height="45"
                                rx="6.5"
                                fill="#EA5E6B"
                              />
                              <rect
                                x="1.5"
                                y="1.5"
                                width="52"
                                height="45"
                                rx="6.5"
                                stroke="black"
                                stroke-width="3"
                              />
                              <path
                                d="M27.5 10C31.0088 13.2147 35.5883 14.8884 40.2682 14.6667C40.9496 17.0669 41.1581 19.5845 40.8813 22.0698C40.6045 24.5552 39.8481 26.9575 38.6571 29.1342C37.466 31.3108 35.8645 33.2173 33.9479 34.7403C32.0313 36.2633 29.8385 37.3719 27.5 38C25.1615 37.3719 22.9687 36.2633 21.0521 34.7403C19.1355 33.2173 17.534 31.3108 16.343 29.1342C15.1519 26.9575 14.3955 24.5552 14.1187 22.0698C13.8419 19.5845 14.0504 17.0669 14.7318 14.6667C19.4117 14.8884 23.9912 13.2147 27.5 10Z"
                                fill="white"
                              />
                              <path
                                d="M25.9981 22.4444C25.9981 22.857 26.1564 23.2527 26.4381 23.5444C26.7198 23.8361 27.1019 24 27.5002 24C27.8986 24 28.2807 23.8361 28.5624 23.5444C28.8441 23.2527 29.0024 22.857 29.0024 22.4444C29.0024 22.0319 28.8441 21.6362 28.5624 21.3445C28.2807 21.0528 27.8986 20.8889 27.5002 20.8889C27.1019 20.8889 26.7198 21.0528 26.4381 21.3445C26.1564 21.6362 25.9981 22.0319 25.9981 22.4444Z"
                                fill="white"
                              />
                              <path d="M27.5002 24V27.8889V24Z" fill="white" />
                              <path
                                d="M27.5002 24C27.1019 24 26.7198 23.8361 26.4381 23.5444C26.1564 23.2527 25.9981 22.857 25.9981 22.4444C25.9981 22.0319 26.1564 21.6362 26.4381 21.3445C26.7198 21.0528 27.1019 20.8889 27.5002 20.8889C27.8986 20.8889 28.2807 21.0528 28.5624 21.3445C28.8441 21.6362 29.0024 22.0319 29.0024 22.4444C29.0024 22.857 28.8441 23.2527 28.5624 23.5444C28.2807 23.8361 27.8986 24 27.5002 24ZM27.5002 24V27.8889M27.5 10C31.0088 13.2147 35.5883 14.8884 40.2682 14.6667C40.9496 17.0669 41.1581 19.5845 40.8813 22.0698C40.6045 24.5552 39.8481 26.9575 38.6571 29.1342C37.466 31.3108 35.8645 33.2173 33.9479 34.7403C32.0313 36.2633 29.8385 37.3719 27.5 38C25.1615 37.3719 22.9687 36.2633 21.0521 34.7403C19.1355 33.2173 17.534 31.3108 16.343 29.1342C15.1519 26.9575 14.3955 24.5552 14.1187 22.0698C13.8419 19.5845 14.0504 17.0669 14.7318 14.6667C19.4117 14.8884 23.9912 13.2147 27.5 10Z"
                                stroke="black"
                                stroke-width="3"
                                stroke-linecap="round"
                                stroke-linejoin="round"
                              />
                            </svg>
                          </div>
                          <div class="desctop-modal__head-title">
                            Чем опасны фишинговые атаки?
                          </div>
                        </div>
                        <div class="desctop-modal__content">
                          <p>
                            Если пользователь не заметил опасности и перешел по
                            ссылке, то злоумышленники получают доступ к
                            различным аккаунтам, например приложениям
                            онлайн-банков, и могут украсть деньги. Также
                            мошенники могут добраться до переписок, фотографий и
                            других личных данных. Опасностей для организаций
                            также немало. Находясь в корпоративной сети,
                            злоумышленники могут:
                          </p>
                          <br />
                          <ul>
                            <li>Cобирать важные рабочие данные</li>
                            <li>
                              Загрузить вирус-вымогатель, который шифрует все
                              данные, после чего хакеры требуют немалую сумму за
                              ключ расшифровки
                            </li>
                            <li>
                              Полностью парализовать работу компании,
                              заблокировав все информационные системы
                            </li>
                          </ul>
                        </div>
                      </div>
                    </swiper-slide>
                    <swiper-slide class="slide-item">
                      <div class="times-slide__body">
                        <div class="desctop-modal__head">
                          <div class="desctop-modal__head-ico">
                            <svg
                              width="55"
                              height="48"
                              viewBox="0 0 55 48"
                              fill="none"
                              xmlns="http://www.w3.org/2000/svg"
                            >
                              <rect
                                x="1.5"
                                y="1.5"
                                width="52"
                                height="45"
                                rx="6.5"
                                fill="#EA5E6B"
                              />
                              <rect
                                x="1.5"
                                y="1.5"
                                width="52"
                                height="45"
                                rx="6.5"
                                stroke="black"
                                stroke-width="3"
                              />
                              <path
                                d="M29.6111 10H25.3889C21.3081 10 18 13.3751 18 17.5385V30.4615C18 34.6249 21.3081 38 25.3889 38H29.6111C33.6919 38 37 34.6249 37 30.4615V17.5385C37 13.3751 33.6919 10 29.6111 10Z"
                                fill="white"
                              />
                              <path
                                d="M27.5 21.8462V10M18 21.8462H37M25.3889 10H29.6111C33.6919 10 37 13.3751 37 17.5385V30.4615C37 34.6249 33.6919 38 29.6111 38H25.3889C21.3081 38 18 34.6249 18 30.4615V17.5385C18 13.3751 21.3081 10 25.3889 10Z"
                                stroke="black"
                                stroke-width="3"
                                stroke-linecap="round"
                                stroke-linejoin="round"
                              />
                            </svg>
                          </div>
                          <div class="desctop-modal__head-title">
                            Какие схемы применяют мошенники?
                          </div>
                        </div>
                        <div class="desctop-modal__content">
                          Чаще всего мошенники используют психологические
                          манипуляции. Они пугают пользователя, придумывают
                          критическую причину для того, чтобы он выдал свою
                          личную информацию. Как правило, сообщения содержат
                          угрозы, например заблокировать счет в случае
                          невыполнения требований. Часто мошенники выдают себя
                          за официальные организации или корпоративные службы,
                          например от лица отдела персонала просят пройти некий
                          опрос.
                          <br />
                          <br />
                          Злоумышленник может связаться с тобой и представиться
                          генеральным директором Hochland. Он может использовать
                          поддельный аккаунт в мессенджере с фотографией, чтобы
                          усыпить бдительность, и будет использовать некую
                          информацию о тебе, чтобы все выглядело естественно.
                          Часто в таком сценарии мошенник звонит и предупреждает
                          о звонке из Роспотребнадзора, Министерства
                          промышленности и торговли России или
                          правоохранительных органов. Он просит никому не
                          сообщать о разговоре, а после него — отчитаться, как
                          все прошло. После этого поступит звонок с неизвестного
                          номера, в процессе которого могут запрашивать
                          конфиденциальную информацию и вынуждать совершать
                          финансовые операции в пользу мошенников. Для большей
                          убедительности мошенник может упоминать имена и
                          фамилии реальных сотрудников компании. Цель такого
                          разговора — узнать конфиденциальные сведения о
                          компании или руководстве, заполучить деньги.
                          <br />
                          <br />
                          Сейчас злоумышленники активно пользуются искусственным
                          интеллектом. Они не только могут писать и звонить под
                          видом вашего знакомого, но и подделывать видео и голос
                          человека, за которого себя выдают.
                        </div>
                      </div>
                    </swiper-slide>
                    <swiper-slide class="slide-item">
                      <div class="times-slide__body">
                        <div class="desctop-modal__head">
                          <div class="desctop-modal__head-ico">
                            <svg
                              width="55"
                              height="48"
                              viewBox="0 0 55 48"
                              fill="none"
                              xmlns="http://www.w3.org/2000/svg"
                            >
                              <rect
                                x="1.5"
                                y="1.5"
                                width="52"
                                height="45"
                                rx="6.5"
                                fill="#EA5E6B"
                              />
                              <rect
                                x="1.5"
                                y="1.5"
                                width="52"
                                height="45"
                                rx="6.5"
                                stroke="black"
                                stroke-width="3"
                              />
                              <path
                                d="M13 24C13 23.1159 13.3592 22.2681 13.9987 21.643C14.6381 21.0179 15.5054 20.6667 16.4098 20.6667H23.2293C24.1336 20.6667 25.0009 21.0179 25.6403 21.643C26.2798 22.2681 26.639 23.1159 26.639 24V35.6667C26.639 36.5507 26.2798 37.3986 25.6403 38.0237C25.0009 38.6488 24.1336 39 23.2293 39H16.4098C15.5054 39 14.6381 38.6488 13.9987 38.0237C13.3592 37.3986 13 36.5507 13 35.6667V24Z"
                                fill="white"
                              />
                              <path
                                d="M16.4098 20.6667V14C16.4098 13.558 16.5894 13.134 16.9091 12.8215C17.2288 12.5089 17.6625 12.3333 18.1146 12.3333H21.5244C21.9766 12.3333 22.4102 12.5089 22.7299 12.8215C23.0497 13.134 23.2293 13.558 23.2293 14V20.6667"
                                fill="white"
                              />
                              <path
                                d="M31.7537 15.6667H31.7707H31.7537Z"
                                fill="white"
                              />
                              <path
                                d="M36.8683 19H36.8854H36.8683Z"
                                fill="white"
                              />
                              <path
                                d="M36.8683 12.3333H36.8854H36.8683Z"
                                fill="white"
                              />
                              <path d="M41.983 9H42H41.983Z" fill="white" />
                              <path
                                d="M41.983 15.6667H42H41.983Z"
                                fill="white"
                              />
                              <path
                                d="M41.983 22.3333H42H41.983Z"
                                fill="white"
                              />
                              <path
                                d="M23.2293 15.6667H24.9342H23.2293Z"
                                fill="white"
                              />
                              <path
                                d="M16.4098 20.6667C15.5054 20.6667 14.6381 21.0179 13.9987 21.643C13.3592 22.2681 13 23.1159 13 24V35.6667C13 36.5507 13.3592 37.3986 13.9987 38.0237C14.6381 38.6488 15.5054 39 16.4098 39H23.2293C24.1336 39 25.0009 38.6488 25.6403 38.0237C26.2798 37.3986 26.639 36.5507 26.639 35.6667V24C26.639 23.1159 26.2798 22.2681 25.6403 21.643C25.0009 21.0179 24.1336 20.6667 23.2293 20.6667M16.4098 20.6667H23.2293M16.4098 20.6667V14C16.4098 13.558 16.5894 13.134 16.9091 12.8215C17.2288 12.5089 17.6625 12.3333 18.1146 12.3333H21.5244C21.9766 12.3333 22.4102 12.5089 22.7299 12.8215C23.0497 13.134 23.2293 13.558 23.2293 14V20.6667M31.7537 15.6667H31.7707M36.8683 19H36.8854M36.8683 12.3333H36.8854M41.9829 9H42M41.9829 15.6667H42M41.9829 22.3333H42M23.2293 15.6667H24.9342"
                                stroke="black"
                                stroke-width="3"
                                stroke-linecap="round"
                                stroke-linejoin="round"
                              />
                            </svg>
                          </div>
                          <div class="desctop-modal__head-title">
                            7 правил кибергигиены
                          </div>
                        </div>
                        <div class="desctop-modal__content">
                          <div class="toggle-block">
                            <div
                              class="toggle-block__head"
                              @click="toggleOpen[0] = !toggleOpen[0]"
                              :class="{ open: toggleOpen[0] }"
                            >
                              <div class="toggle-block__num">
                                <img
                                  src="@/assets/img/modules/module-10/nums/1.svg"
                                  alt=""
                                />
                              </div>
                              <div class="toggle-block__title">
                                Не доверяй письмам и сообщениям с незнакомых
                                адресов
                              </div>
                              <div class="toggle-block__arrow"></div>
                            </div>
                            <Vue3SlideUpDown v-model="toggleOpen[0]">
                              <div class="toggle-block__body">
                                Если ты получил письмо с незнакомого адреса и в
                                нем пытаются вызвать острую эмоцию (страх,
                                спешка, любопытство) — вероятнее всего, это
                                фишинг
                              </div>
                            </Vue3SlideUpDown>
                          </div>

                          <div class="toggle-block">
                            <div
                              class="toggle-block__head"
                              @click="toggleOpen[1] = !toggleOpen[1]"
                              :class="{ open: toggleOpen[1] }"
                            >
                              <div class="toggle-block__num">
                                <img
                                  src="@/assets/img/modules/module-10/nums/2.svg"
                                  alt=""
                                />
                              </div>
                              <div class="toggle-block__title">
                                Тщательно проверяй имя отправителя
                              </div>
                              <div class="toggle-block__arrow"></div>
                            </div>
                            <Vue3SlideUpDown v-model="toggleOpen[1]">
                              <div class="toggle-block__body">
                                Мошенники часто маскируются под ведомства и
                                известные компании, но создать идентичное
                                почтовое имя или домен сайта невозможно, поэтому
                                в них всегда есть отличия. Например, «!» вместо
                                «i» или лишние символы. На официальных сайтах
                                этих организаций можно найти настоящие почтовые
                                адреса и сравнить
                              </div>
                            </Vue3SlideUpDown>
                          </div>

                          <div class="toggle-block">
                            <div
                              class="toggle-block__head"
                              @click="toggleOpen[2] = !toggleOpen[2]"
                              :class="{ open: toggleOpen[2] }"
                            >
                              <div class="toggle-block__num">
                                <img
                                  src="@/assets/img/modules/module-10/nums/3.svg"
                                  alt=""
                                />
                              </div>
                              <div class="toggle-block__title">
                                Пароль и двухфакторная аутентификация
                              </div>
                              <div class="toggle-block__arrow"></div>
                            </div>
                            <Vue3SlideUpDown v-model="toggleOpen[2]">
                              <div class="toggle-block__body">
                                Это правило больше подходит для частного
                                пользования, однако доступ к твоему смартфону
                                также может поставить под удар компанию. Поэтому
                                во всех приложениях ставь сложные пароли (более
                                11 знаков, сочетание букв, цифр и спецсимволов –
                                @, !, %) и включай двухфакторную аутентификацию
                              </div>
                            </Vue3SlideUpDown>
                          </div>

                          <div class="toggle-block">
                            <div
                              class="toggle-block__head"
                              @click="toggleOpen[3] = !toggleOpen[3]"
                              :class="{ open: toggleOpen[3] }"
                            >
                              <div class="toggle-block__num">
                                <img
                                  src="@/assets/img/modules/module-10/nums/4.svg"
                                  alt=""
                                />
                              </div>
                              <div class="toggle-block__title">
                                Всегда обновляйте операционную систему и
                                приложения
                              </div>
                              <div class="toggle-block__arrow"></div>
                            </div>
                            <Vue3SlideUpDown v-model="toggleOpen[3]">
                              <div class="toggle-block__body">
                                Разработчики следят за угрозами и «дырами» в
                                собственных продуктах и регулярно их устраняют.
                                Поэтому, чем быстрее обновляется сервис, тем
                                меньше вероятности, что злоумышленники
                                используют найденные уязвимости
                              </div>
                            </Vue3SlideUpDown>
                          </div>

                          <div class="toggle-block">
                            <div
                              class="toggle-block__head"
                              @click="toggleOpen[4] = !toggleOpen[4]"
                              :class="{ open: toggleOpen[4] }"
                            >
                              <div class="toggle-block__num">
                                <img
                                  src="@/assets/img/modules/module-10/nums/5.svg"
                                  alt=""
                                />
                              </div>
                              <div class="toggle-block__title">
                                Не используй корпоративный компьютер как личный
                              </div>
                              <div class="toggle-block__arrow"></div>
                            </div>
                            <Vue3SlideUpDown v-model="toggleOpen[4]">
                              <div class="toggle-block__body">
                                Если ты попробуешь подключиться к компьютеру в
                                личных целях: вставить флешку, посмотреть
                                галерею телефона и т.д., то действие будет
                                заблокировано системой безопасности. Не пытайся
                                это обойти
                              </div>
                            </Vue3SlideUpDown>
                          </div>

                          <div class="toggle-block">
                            <div
                              class="toggle-block__head"
                              @click="toggleOpen[5] = !toggleOpen[5]"
                              :class="{ open: toggleOpen[5] }"
                            >
                              <div class="toggle-block__num">
                                <img
                                  src="@/assets/img/modules/module-10/nums/6.svg"
                                  alt=""
                                />
                              </div>
                              <div class="toggle-block__title">
                                Не храни конфиденциальную информацию в доступных
                                местах
                              </div>
                              <div class="toggle-block__arrow"></div>
                            </div>
                            <Vue3SlideUpDown v-model="toggleOpen[5]">
                              <div class="toggle-block__body">
                                Все конфиденциальные документы и пароли нельзя
                                оставлять без присмотра на столе или в не
                                запертом шкафу/ящике. Также нежелательно
                                записывать их в блокнот
                              </div>
                            </Vue3SlideUpDown>
                          </div>

                          <div class="toggle-block">
                            <div
                              class="toggle-block__head"
                              @click="toggleOpen[6] = !toggleOpen[6]"
                              :class="{ open: toggleOpen[6] }"
                            >
                              <div class="toggle-block__num">
                                <img
                                  src="@/assets/img/modules/module-10/nums/7.svg"
                                  alt=""
                                />
                              </div>
                              <div class="toggle-block__title">
                                Не сообщай личную и конфиденциальную информацию
                                непроверенным контактам
                              </div>
                              <div class="toggle-block__arrow"></div>
                            </div>
                            <Vue3SlideUpDown v-model="toggleOpen[6]">
                              <div class="toggle-block__body">
                                Будь внимателен и помни, что руководство
                                компании использует для коммуникаций с
                                сотрудниками только официальные каналы:
                                электронная почта или MS Teams — для личных
                                сообщений, а также корпоративный портал и
                                соцсеть Viva Engage — для массовых коммуникаций.
                                <br /><br />
                                А сотрудники полиции, банков, пенсионных фондов
                                и других органов не звонят, в том числе через
                                мессенджеры, чтобы узнать ответы на какие-либо
                                вопросы или запросить личную/конфиденциальную
                                информацию
                              </div>
                            </Vue3SlideUpDown>
                          </div>
                        </div>
                      </div>
                    </swiper-slide>
                    <div class="nav-buttons">
                      <div class="slider-prev-btn">Назад</div>
                      <div class="slider-next-btn">Дальше</div>
                    </div>
                  </swiper>
                  <div class="line"></div>
                </div>
                <button
                  class="modal-btn"
                  :disabled="!sanitazerModalWiewed"
                  @click="compliteStep(3)"
                >
                  Просмотрено
                </button>
              </div>
            </div>
          </div>
        </transition>
        <!-- QuizModal -->
        <transition name="fade" mode="out-in">
          <QuizModal
            v-if="showQuiz"
            @modalClose="showQuiz = false"
            :questionsList="questionsList"
            :step="10"
          >
            <div class="result__image">
              <img
                src="@/assets/img/modules/module-10/modal-result.png"
                alt=""
                rel="preload"
              />
            </div>
            <div class="result__text">
              Ты ответил правильно <br />
              на все вопросы!
            </div>
            <div class="result__btn" @click="compliteModule">
              Закрыть модуль
            </div>
          </QuizModal>
        </transition>
      </div>
    </div>
  </div>
</template>

<script setup>
import { ref, onMounted, watch } from "vue";
import { Swiper, SwiperSlide } from "swiper/vue";
import { Navigation, Pagination, EffectFade, Controller } from "swiper/modules";
import { Vue3SlideUpDown } from "vue3-slide-up-down";
import QuizModal from "@/components/QuizModal.vue";

import { useRouter } from "vue-router";
const router = useRouter();
import { useGameStore } from "@/stores/GameStore.js";
import { storeToRefs } from "pinia";

const store = useGameStore();
const { userCompliteGame } = storeToRefs(store);
const controlledSwiper = ref(null);
const stepLoad = ref(false);
const moduleStep = ref(null);
const isInteractive = ref(false);
const showQuiz = ref(false);
const showTrashModal = ref(false);
const showDesctopModal = ref(false);
const sliderModalWiewed = ref(false);
const showSanitazerModal = ref(false);
const sanitazerModalWiewed = ref(false);
const setControlledSwiper = (swiper) => {
  controlledSwiper.value = swiper;
};

const toggleOpen = ref({
  0: true,
  1: false,
  2: false,
  3: false,
  4: false,
  5: false,
  6: false,
});

watch(
  () => toggleOpen,
  () => {
    console.log("!!!");

    setTimeout(() => {
      controlledSwiper.value.update();
    }, 100);
  },
  { deep: true }
);

const questionsList = [
  {
    id: 0,
    title: "Что нужно делать со своим рабочим местом?",
    options: [
      {
        id: 0,
        title: "Все что душе угодно",
        correctAnswer: false,
      },
      {
        id: 1,
        title: "Переставлять его в удобное место ",
        correctAnswer: false,
      },
      {
        id: 2,
        title: "Держать его в чистоте",
        correctAnswer: true,
      },
      {
        id: 3,
        title: "Использовать его как хранилище вещей",
        correctAnswer: false,
      },
    ],
  },

  {
    id: 1,
    title: "Где можно изучить материалы об информационной безопасности?",
    options: [
      {
        id: 0,
        title: "В любой городской библиотеке ",
        correctAnswer: false,
      },
      {
        id: 1,
        title: "На образовательной платформе SoSafe",
        correctAnswer: true,
      },
      {
        id: 2,
        title: "В листовках на проходной ",
        correctAnswer: false,
      },
      {
        id: 3,
        title: "На стенде с объявлениями",
        correctAnswer: false,
      },
    ],
  },

  {
    id: 2,
    title:
      "Как называется вид интернет-мошенничества, при котором злоумышленники присылают пользователям по электронной почте ссылки в письмах? ",
    options: [
      {
        id: 0,
        title: "Фишинг",
        correctAnswer: true,
      },
      {
        id: 1,
        title: "Акулинг",
        correctAnswer: false,
      },
      {
        id: 2,
        title: "Рыбинг",
        correctAnswer: false,
      },
      {
        id: 3,
        title: "Карасинг",
        correctAnswer: false,
      },
    ],
  },

  {
    id: 3,
    title: "Можно ли использовать личную флешку на корпоративном компьютере?",
    options: [
      {
        id: 0,
        title: "Да, только для рабочих документов",
        correctAnswer: false,
      },
      {
        id: 1,
        title: "Да, только если не скачиваешь на нее корпоративные данные",
        correctAnswer: false,
      },
      {
        id: 2,
        title: "Да, только во внерабочее время ",
        correctAnswer: false,
      },
      {
        id: 3,
        title: "Нет, нельзя",
        correctAnswer: true,
      },
    ],
  },
];

const openStep = (step) => {
  const currentStep = moduleStep.value;
  if (step == 1 && currentStep >= 1) {
    showTrashModal.value = true;
  }

  if (step == 2 && currentStep >= 2) {
    showDesctopModal.value = true;
  }

  if (step == 3 && currentStep >= 3) {
    showSanitazerModal.value = true;
  }

  if (step == 4 && currentStep >= 4) {
    showQuiz.value = true;
  }
  console.log(step);
};

const compliteStep = (step) => {
  if (step == 1) {
    showTrashModal.value = false;
    if (moduleStep.value < 2) {
      moduleStep.value = 2;
    }
  }

  if (step == 2) {
    showDesctopModal.value = false;
    if (moduleStep.value < 3) {
      moduleStep.value = 3;
    }
  }

  if (step == 3) {
    showSanitazerModal.value = false;
    if (moduleStep.value < 4) {
      moduleStep.value = 4;
    }
  }
};

const compliteModule = () => {
  // store.openNewStep(8);
  userCompliteGame.value = true;
  router.push("/");
};

onMounted(() => {
  setTimeout(() => {
    setTimeout(() => {
      moduleStep.value = 1;
    }, 500);

    stepLoad.value = true;
    isInteractive.value = true;
  }, 800);
});
</script>

<style lang="scss" scoped>
.desctop-modal__head-ico {
  width: fromWidth(55);
  height: fromWidth(48);
  svg {
    width: 100%;
    height: 100%;
    object-fit: contain;
  }
}
.toggle-block {
  border-radius: fromWidth(20);
  border: fromWidth(3) solid #000;
  background: #fff;
  &:not(:last-child) {
    margin-bottom: fromWidth(32);
  }
}

.toggle-block__body {
  padding: fromWidth(32);
  padding-top: fromWidth(24);
  position: relative;
  &::before {
    position: absolute;
    top: 0;
    left: fromWidth(24);
    width: calc(100% - fromWidth(48));
    content: "";
    height: fromWidth(2);
    background-color: #ddd;
  }
}
.toggle-block__head {
  cursor: pointer;
  display: flex;
  align-items: center;
  padding: fromWidth(24);
  gap: fromWidth(28);
  color: #000;
  font-family: "Open Sans";
  font-size: fromWidth(24);
  font-style: normal;
  font-weight: 700;
  line-height: 158.333%; /* 158.333% */
  &.open .toggle-block__arrow {
    transform: scaleY(1);
  }
}

.toggle-block__num {
  width: fromWidth(50);
  height: fromWidth(50);
  flex-shrink: 0;
  img {
    width: 100%;
    height: 100%;
    object-fit: contain;
  }
}
.toggle-block__arrow {
  transform: scaleY(-1);
  transition: transform 0.3s ease-in-out;
  margin-left: auto;
  flex-shrink: 0;
  width: fromWidth(30);
  height: fromWidth(30);
  background-repeat: no-repeat;
  background-size: contain;
  background-position: center;
  background-image: url("data:image/svg+xml;charset=UTF-8,%3csvg width='30' height='22' viewBox='0 0 30 22' fill='none' xmlns='http://www.w3.org/2000/svg'%3e%3cpath fill-rule='evenodd' clip-rule='evenodd' d='M17.3058 4.09389C16.0323 2.77212 13.9677 2.77212 12.6942 4.09389L3.99856 13.1195C2.72511 14.4413 2.72511 16.5843 3.99856 17.9061C5.27201 19.2279 7.33668 19.2279 8.61013 17.9061L15 11.2737L21.3899 17.9061C22.6633 19.2279 24.728 19.2279 26.0014 17.9061C27.2749 16.5843 27.2749 14.4413 26.0014 13.1195L17.3058 4.09389Z' fill='%230ABBEF'/%3e%3cpath fill-rule='evenodd' clip-rule='evenodd' d='M19.4771 1.9199C17.0109 -0.639969 12.9891 -0.639968 10.5229 1.9199L1.8272 10.9455C-0.609069 13.4743 -0.609069 17.5514 1.8272 20.0801C4.29348 22.64 8.31521 22.64 10.7815 20.0801L15 15.7015L19.2185 20.0801C21.6848 22.64 25.7065 22.64 28.1728 20.0801C30.6091 17.5514 30.6091 13.4743 28.1728 10.9455L19.4771 1.9199ZM21.3899 17.9061C22.6633 19.2279 24.728 19.2279 26.0014 17.9061C27.2749 16.5843 27.2749 14.4413 26.0014 13.1195L17.3058 4.09389C16.0323 2.77212 13.9677 2.77212 12.6942 4.09389L3.99856 13.1195C2.72511 14.4413 2.72511 16.5843 3.99856 17.9061C5.27201 19.2279 7.33668 19.2279 8.61013 17.9061L15 11.2737L21.3899 17.9061Z' fill='black'/%3e%3c/svg%3e ");
}
.times-slide__body {
  padding: 0;
  overflow: hidden;
  display: block;
  font-family: "Open Sans";
}

.sanitazer-modal {
  .modal-content {
    overflow: hidden;
    background-image: url(@/assets/img/modules/module-10/modal-ico-3.svg) !important;
  }
}
.line {
  width: 100%;
  height: 2px;
  background-color: #ddd;
  margin: fromWidth(48) 0;
}
.desctop-modal {
  .tabs-modal__inner {
    padding-left: fromWidth(300) !important;
  }

  .modal-content {
    background-image: url(@/assets/img/modules/module-10/modal-ico-2.svg) !important;
  }
}

.desctop-modal__head {
  background: linear-gradient(90deg, #f0e7f1 0%, #e2f2fa 100%);
  padding: fromWidth(24) fromWidth(32);
  width: 100%;
  box-sizing: border-box;
  display: flex;
  align-items: center;
  gap: fromWidth(24);
  color: #000;
  font-size: fromWidth(24);
  font-style: normal;
  font-weight: 700;
  line-height: normal;
}

.desctop-modal__content {
  padding: fromWidth(32) fromWidth(40);
  color: #000;
  font-size: fromWidth(24);
  font-style: normal;
  font-weight: 600;
  line-height: 158.333%; /* 158.333% */
  a {
    color: #00c5ff;
    text-decoration: none;
  }
  ul h3 {
    margin-bottom: fromWidth(10);
  }
}

.step-wrapper__content {
  background-image: url(@/assets/img/modules/module-10/module-10-bg.svg);
  background-size: contain;
}

.trash-modal {
  font-family: "Open Sans";
  color: #000;
  .tabs-modal__inner {
    padding-left: fromWidth(330);
  }
  .modal-content {
    background-image: url(@/assets/img/modules/module-10/modal-ico-1.svg);
    background-position: top fromWidth(40) left fromWidth(40);
  }
  h1 {
    font-weight: 700;
    line-height: normal;
    font-size: fromWidth(32);
    margin: 0;
    margin-bottom: fromWidth(48);
  }

  h3 {
    font-size: fromWidth(24);
    font-weight: 700;
    line-height: 158.333%; /* 158.333% */
    margin: 0;
    margin-bottom: fromWidth(32);
  }
  ul {
    padding-left: fromWidth(26);
    margin: 0;
    margin-bottom: fromWidth(50);
  }
  li {
    font-size: fromWidth(24);
    margin-bottom: fromWidth(24);
    font-style: normal;
    font-weight: 600;
    line-height: 158.333%; /* 158.333% */
    &::marker {
      color: #00c5ff;
    }
  }
}
.arrow-template {
  pointer-events: none;
  position: absolute;
  width: 123px;
  height: 215px;
  opacity: 0;
  visibility: hidden;
  transition: opacity 0.5s ease-in-out, visibility 0.5s ease-in-out;

  .arrow-template_img {
    width: 100%;
    height: 100%;
    background-image: url("data:image/svg+xml;charset=UTF-8,%3csvg width='123' height='215' viewBox='0 0 123 215' fill='none' xmlns='http://www.w3.org/2000/svg'%3e%3cmask id='mask0_2109_5305' style='mask-type:alpha' maskUnits='userSpaceOnUse' x='0' y='0' width='123' height='215'%3e%3crect width='123' height='215' fill='%23D9D9D9'/%3e%3c/mask%3e%3cg mask='url(%23mask0_2109_5305)'%3e%3cg filter='url(%23filter0_d_2109_5305)'%3e%3cpath d='M87.9582 141.996L122.182 138.826L55.3048 213.776L16.3366 130.375L53.1999 139.875C53.1999 139.875 85.3189 64.9363 11.6033 1.59618C11.6033 1.59618 99.0172 34.3266 87.9582 141.996Z' fill='white'/%3e%3cpath d='M87.8383 142.117C98.0684 141.373 112.148 140.466 122.259 139.657L121.561 138.279C99.5735 162.253 75.7978 188.556 54.2251 212.814L56.6136 213.164C44.235 187.113 29.108 156.252 16.8057 130.168L16.2058 130.889C26.8613 133.666 42.2501 137.591 53.0473 140.477C56.69 135.535 57.3989 127.632 59.0239 121.477C68.5451 76.0544 47.7577 29.2216 12.7377 0.273624L10.9927 3.2362C65.8185 26.74 93.7931 83.9364 87.8383 142.117ZM88.0673 141.887C96.5742 87.8719 71.2062 30.3039 22.0843 4.69016C19.7286 3.55323 7.49174 -4.06639 10.4582 2.91917C50.0808 34.8516 70.7482 90.7033 52.6437 139.646L53.3417 139.296C42.37 137.055 26.3378 131.469 15.835 130.244C15.5951 130.649 25.4653 151.135 25.4762 151.507C33.9176 170.19 45.4347 195.76 53.9852 214.388C55.7847 218.772 70.181 197.957 73.0821 195.99C88.6017 178.487 107.491 157.072 122.804 139.384C125.967 135.721 90.8921 142.335 88.0782 141.887L88.0673 141.887Z' fill='black'/%3e%3c/g%3e%3c/g%3e%3cdefs%3e%3cfilter id='filter0_d_2109_5305' x='-0.00244141' y='0' width='123.008' height='215' filterUnits='userSpaceOnUse' color-interpolation-filters='sRGB'%3e%3cfeFlood flood-opacity='0' result='BackgroundImageFix'/%3e%3cfeColorMatrix in='SourceAlpha' type='matrix' values='0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0' result='hardAlpha'/%3e%3cfeOffset dx='-10'/%3e%3cfeComposite in2='hardAlpha' operator='out'/%3e%3cfeColorMatrix type='matrix' values='0 0 0 0 0.0392157 0 0 0 0 0.733333 0 0 0 0 0.937255 0 0 0 1 0'/%3e%3cfeBlend mode='normal' in2='BackgroundImageFix' result='effect1_dropShadow_2109_5305'/%3e%3cfeBlend mode='normal' in='SourceGraphic' in2='effect1_dropShadow_2109_5305' result='shape'/%3e%3c/filter%3e%3c/defs%3e%3c/svg%3e ");
    background-repeat: no-repeat;
    background-size: contain;
    background-position: center;
  }

  &.show {
    opacity: 1;
    visibility: visible;
    .arrow-template_img {
      animation: heartBeat 4s ease-in-out infinite 1s;
    }
  }

  &[data-item="1"] {
    left: 11%;
    width: 6%;
    height: 20%;
    top: 26%;
    z-index: 4;
    transform: rotate(341deg);
  }

  &[data-item="2"] {
    left: 42%;
    width: 6%;
    height: 20%;
    top: 26%;
    z-index: 4;
    transform: rotate(348deg);
  }

  &[data-item="3"] {
    left: 56%;
    width: 6%;
    height: 20%;
    top: 7%;
    z-index: 4;
    transform: rotate(55deg) scaleX(-1);
  }

  &[data-item="4"] {
    left: 62%;
    width: 6%;
    height: 20%;
    top: 4%;
    z-index: 4;
    transform: rotate(275deg);
  }
}
.bg-segment {
  position: absolute;
  right: 8.4%;
  bottom: -1%;
  width: 43%;
  height: 68.5%;
  z-index: 5;
  pointer-events: none;
  img {
    width: 100%;
    height: 100%;
    object-fit: contain;
  }
}
.interactive-item {
  cursor: pointer;
  transition: opacity 0.2s ease-in-out, filter 0.5s ease-in-out;
  filter: drop-shadow(0px 6px 0px rgba(0, 0, 0, 0));
  position: absolute;

  &.pulse {
    z-index: 3;
    filter: drop-shadow(0px 6px 10px #00c5ff) drop-shadow(0px -6px 10px #00c5ff);
    animation: dropShadow 3s linear infinite 0.4s;
  }

  img {
    width: 100%;
    object-fit: contain;
    height: 100%;
  }

  &[data-item="1"] {
    left: 0%;
    width: 43%;
    height: 52%;
    bottom: -1%;
    img {
      object-position: left bottom;
    }
  }

  &[data-item="2"] {
    left: 37.3%;
    width: 20%;
    height: 37%;
    bottom: 18%;
  }

  &[data-item="3"] {
    left: 49%;
    width: 6%;
    height: 18%;
    bottom: 58.6%;
  }

  &[data-item="4"] {
    right: 16.5%;
    width: 11%;
    height: 26%;
    top: 3%;
  }
}
</style>
